In [32]:
print("------------------ct prepration -mysql------------------- \n---------------------------guvi-----------------------------")

------------------ct prepration -mysql-------------------
---------------------------guvi-----------------------------

In [1]:
import mysql.connector

In [3]:
#) estabishing the connection between jupyter notebook and mysql
connection = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = '@@@@@@'
)
cursor = connection.cursor()

In [4]:
#) new database cumulative_test
query = 'create database cumulative_test'
cursor.execute(query)

In [6]:
#) showing all the database in my sql
query = 'show databases'
cursor.execute(query)
for database in cursor:
    print(database)

('cumulative_test',)
('d101',)
('flowers',)
('information_schema',)
('mysql',)
('pay',)
('performance_schema',)
('sakila',)
('sudharsan',)
('sys',)
('world',)

In [7]:
#) selecting the database
connection = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'Rudra@014',
    database = "cumulative_test"
)
cursor = connection.cursor()

In [18]:
#) creating the table
query = """create table construction(bricks_num int, cement_type varchar(100), 
           cement_quantity int, sand_quantity float, house_type varchar(1000))"""
cursor.execute(query)

In [19]:
#) showing construction table
query = 'DESC construction'
cursor.execute(query)
result = cursor.fetchall()
for col in result:
    print(col[0],col[1])

bricks_num int
cement_type varchar(100)
cement_quantity int
sand_quantity float
house_type varchar(1000)

In [20]:
#) showing table construction
query = 'DESC construction'
cursor.execute(query)
result = cursor.fetchall()
for col in result:
    print(col[0])

bricks_num
cement_type
cement_quantity
sand_quantity
house_type

In [21]:
#) primary key
query = """create table house(
                             house_num int primary key,
                             floor_num int, 
                             location varchar(100))"""
cursor.execute(query)

In [22]:
#) showing table house 
query = 'DESC house'
cursor.execute(query)
result = cursor.fetchall()
for col in result:
    print(col[0],col[1])

house_num int
floor_num int
location varchar(100)

In [23]:
#) inserting data in the table construction
query = """insert into construction(bricks_num,cement_type,cement_quantity,sand_quantity,house_type)
       values(10,'A-grade',10,20,"flat")"""
cursor.execute(query)
connection.commit()

In [26]:
#) inserting data into the table construction
query = """insert into construction values(15,"B-grade",12,14,"villah")"""
cursor.execute(query)
connection.commit()

In [27]:
#) inserting data into the table construction
query = """insert into construction values(%s,%s,%s,%s,%s)"""
data = (12,"B-grade",15,14,"individual")
cursor.execute(query,data)
connection.commit()

In [31]:
#) inserting many data into table construction
query = """insert into construction values(%s,%s,%s,%s,%s)"""
data = [
    (12,'A-grade',13,12,"villah"),
    (14,'B-grade',12,15,"flat"),
    (12,'A-grade',12,15,"individual")
]
cursor.executemany(query,data)
connection.commit()

In [33]:
#) to display the all data from table construction 
query = "select * from construction"
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(10, 'A-grade', 10, 20.0, 'flat')
(15, 'B-grade', 12, 14.0, 'villah')
(12, 'B-grade', 15, 14.0, 'individual')
(12, 'A-grade', 13, 12.0, 'villah')
(14, 'B-grade', 12, 15.0, 'flat')
(12, 'A-grade', 12, 15.0, 'individual')

In [34]:
#) to display one column data from the table
query = "select bricks_num from construction"
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(10,)
(15,)
(12,)
(12,)
(14,)
(12,)

In [35]:
#) to display two column data from the table
query = "select bricks_num,cement_type from construction"
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(10, 'A-grade')
(15, 'B-grade')
(12, 'B-grade')
(12, 'A-grade')
(14, 'B-grade')
(12, 'A-grade')

In [39]:
#) to get specific data from table construction
query = """select * from construction where cement_type = 'A-grade'"""
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(10, 'A-grade', 10, 20.0, 'flat')
(12, 'A-grade', 13, 12.0, 'villah')
(12, 'A-grade', 12, 15.0, 'individual')

In [40]:
#) to get specific data from table contruction
query = """select * from construction where bricks_num = 12"""
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(12, 'B-grade', 15, 14.0, 'individual')
(12, 'A-grade', 13, 12.0, 'villah')
(12, 'A-grade', 12, 15.0, 'individual')

In [43]:
#) to get specific data from table contruction
query = """select* from construction where cement_type = 'B-grade' limit 2"""
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(15, 'B-grade', 12, 14.0, 'villah')
(12, 'B-grade', 15, 14.0, 'individual')

In [45]:
#) to replace one row data with new data
query = """update construction set bricks_num = 20 where cement_quantity = 12"""
cursor.execute(query)
connection.commit()

In [51]:
#) to display the all data from table construction 
query = "select * from construction"
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(10, 'A-grade', 10, 20.0, 'flat')
(20, 'B-grade', 12, 14.0, 'villah')
(12, 'B-grade', 15, 14.0, 'individual')
(12, 'A-grade', 13, 12.0, 'villah')
(20, 'B-grade', 12, 15.0, 'flat')
(20, 'A-grade', 12, 15.0, 'individual')

In [52]:
query = """delete from construction where bricks_num = 10"""
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

In [54]:
query = "select * from construction"
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(20, 'B-grade', 12, 14.0, 'villah')
(12, 'B-grade', 15, 14.0, 'individual')
(12, 'A-grade', 13, 12.0, 'villah')
(20, 'B-grade', 12, 15.0, 'flat')
(20, 'A-grade', 12, 15.0, 'individual')

In [55]:
#) count, min, max of a column value
query = """select count("cement_type"),min(bricks_num),max(bricks_num) from construction"""
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

(5, 12, 20)

In [5]:
#) alter the datatype of a column
#query = "alter table construction add location varchar(100)"
#cursor.execute(query)

In [6]:
query = "select * from construction"
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(20, 'B-grade', 12, 14.0, 'villah', None)
(12, 'B-grade', 15, 14.0, 'individual', None)
(12, 'A-grade', 13, 12.0, 'villah', None)
(20, 'B-grade', 12, 15.0, 'flat', None)
(20, 'A-grade', 12, 15.0, 'individual', None)

In [7]:
#) to replace one row data with new data
query = """update construction set location = "loc1" where cement_quantity = 12"""
cursor.execute(query)
connection.commit()

In [8]:
query = "select * from construction"
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(20, 'B-grade', 12, 14.0, 'villah', 'loc1')
(12, 'B-grade', 15, 14.0, 'individual', None)
(12, 'A-grade', 13, 12.0, 'villah', None)
(20, 'B-grade', 12, 15.0, 'flat', 'loc1')
(20, 'A-grade', 12, 15.0, 'individual', 'loc1')

In [9]:
#) to replace one row data with new data
query = """update construction set location = "loc2" where bricks_num = 20"""
cursor.execute(query)
connection.commit()

In [10]:
query = "select * from construction"
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(20, 'B-grade', 12, 14.0, 'villah', 'loc2')
(12, 'B-grade', 15, 14.0, 'individual', None)
(12, 'A-grade', 13, 12.0, 'villah', None)
(20, 'B-grade', 12, 15.0, 'flat', 'loc2')
(20, 'A-grade', 12, 15.0, 'individual', 'loc2')

In [11]:
#) to replace one row data with new data
query = """update construction set location = "loc1" where bricks_num = 12"""
cursor.execute(query)
connection.commit()

In [12]:
query = "select * from construction"
cursor.execute(query)
for row in cursor.fetchall():
    print(row)

(20, 'B-grade', 12, 14.0, 'villah', 'loc2')
(12, 'B-grade', 15, 14.0, 'individual', 'loc1')
(12, 'A-grade', 13, 12.0, 'villah', 'loc1')
(20, 'B-grade', 12, 15.0, 'flat', 'loc2')
(20, 'A-grade', 12, 15.0, 'individual', 'loc2')

In [13]:
#) to drop a column
query = "alter table construction drop column location"
cursor.execute(query)
query = "select* from construction"
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

(20, 'B-grade', 12, 14.0, 'villah')
(12, 'B-grade', 15, 14.0, 'individual')
(12, 'A-grade', 13, 12.0, 'villah')
(20, 'B-grade', 12, 15.0, 'flat')
(20, 'A-grade', 12, 15.0, 'individual')

In [16]:
#) to drop two column
query = """alter table construction drop column bricks_num,drop column cement_quantity"""
cursor.execute(query)
query = "select* from construction"
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

('B-grade', 14.0, 'villah')
('B-grade', 14.0, 'individual')
('A-grade', 12.0, 'villah')
('B-grade', 15.0, 'flat')
('A-grade', 15.0, 'individual')

In [17]:
#) creating two tables
query1 = """create table student(roll_number int, student_name varchar(100),marks float)"""
query2 = """create table address(roll_number int, city varchar(100))"""
cursor.execute(query1)
cursor.execute(query2)

In [18]:
#)inserting data into table 1
query = """insert into student values(%s,%s,%s)"""
data = [
    (5001,"dev",71.5),
    (5002,"jagadeesh",76.9),
    (5003,"parameshwar",77.5)
]
cursor.executemany(query,data)
connection.commit()

In [20]:
#)inserting data into table 1
query = """insert into student values(%s,%s,%s)"""
data =(4001,"ram",61.5)
cursor.execute(query,data)
connection.commit()

In [23]:
query = "select* from student"
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

(5001, 'dev', 71.5)
(5002, 'jagadeesh', 76.9)
(5003, 'parameshwar', 77.5)
(4001, 'ram', 61.5)

In [9]:
#) inserting data into table 2
query = """insert into address values(%s,%s)"""
data = [
    (5001,"coimbatore"),
    (5002,"salem"),
    (5003,"chennai")
]
cursor.executemany(query,data)
connection.commit()

In [21]:
#)inserting data into table 2
query = """insert into address values(%s,%s)"""
data =(3001,"Erode")
cursor.execute(query,data)
connection.commit()

In [22]:
query = "select* from address"
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

(5001, 'coimbatore')
(5002, 'salem')
(5003, 'chennai')
(3001, 'Erode')

In [ ]:
query1 = "create table bank1(account_number int, name varchar(40), balance int, aadhar_number int)"
query2 = "create table aadhar1(number int, address varchar(40), father_name varchar(60))"
cursor.execute(query1)
cursor.execute(query2)

query = "select * from bank inner join aadhar on bank.aadhar_number=aadhar.number"
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

In [12]:
#) rename the column
query = """ALTER TABLE Student RENAME Column roll_number to number"""
cursor.execute(query)

In [24]:
#)inner join
query = """select * from student inner join address on student.number = address.roll_number"""
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

(5001, 'dev', 71.5, 5001, 'coimbatore')
(5002, 'jagadeesh', 76.9, 5002, 'salem')
(5003, 'parameshwar', 77.5, 5003, 'chennai')

In [25]:
#)left join
query = """select * from student left join address on student.number = address.roll_number"""
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

(5001, 'dev', 71.5, 5001, 'coimbatore')
(5002, 'jagadeesh', 76.9, 5002, 'salem')
(5003, 'parameshwar', 77.5, 5003, 'chennai')
(4001, 'ram', 61.5, None, None)

In [26]:
#)right join
query = """select * from student right join address on student.number = address.roll_number"""
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

(5001, 'dev', 71.5, 5001, 'coimbatore')
(5002, 'jagadeesh', 76.9, 5002, 'salem')
(5003, 'parameshwar', 77.5, 5003, 'chennai')
(None, None, None, 3001, 'Erode')

In [27]:
query = "select * from student cross join address"
cursor.execute(query)
for data in cursor.fetchall():
    print(data)

(4001, 'ram', 61.5, 5001, 'coimbatore')
(5003, 'parameshwar', 77.5, 5001, 'coimbatore')
(5002, 'jagadeesh', 76.9, 5001, 'coimbatore')
(5001, 'dev', 71.5, 5001, 'coimbatore')
(4001, 'ram', 61.5, 5002, 'salem')
(5003, 'parameshwar', 77.5, 5002, 'salem')
(5002, 'jagadeesh', 76.9, 5002, 'salem')
(5001, 'dev', 71.5, 5002, 'salem')
(4001, 'ram', 61.5, 5003, 'chennai')
(5003, 'parameshwar', 77.5, 5003, 'chennai')
(5002, 'jagadeesh', 76.9, 5003, 'chennai')
(5001, 'dev', 71.5, 5003, 'chennai')
(4001, 'ram', 61.5, 3001, 'Erode')
(5003, 'parameshwar', 77.5, 3001, 'Erode')
(5002, 'jagadeesh', 76.9, 3001, 'Erode')
(5001, 'dev', 71.5, 3001, 'Erode')